app/Controllers/Grupos.php

SELECT *
FROM `grupos`
WHERE `grupos`.`id` = 7
---
    private function buscaGrupoOu404(int $id = null)
    {

        if (!$id || !$grupo = $this->grupoModel->withDeleted(true)->find($id)) {