app/Controllers/Usuarios.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = 4999
---
    private function buscaUsuarioOu404(int $id = null)
    {

        if (!$id || !$usuario = $this->usuarioModel->withDeleted(true)->find($id)) {