app/Models/GrupoPermissaoModel.php

SELECT COUNT(*) AS `numrows`
FROM (
SELECT `grupos_permissoes`.`id`, `grupos`.`id` AS `grupo_id`, `permissoes`.`id` AS `permissao_id`, `permissoes`.`nome`
FROM `grupos_permissoes`
JOIN `grupos` ON `grupos`.`id` = `grupos_permissoes`.`grupo_id`
JOIN `permissoes` ON `permissoes`.`id` = `grupos_permissoes`.`permissao_id`
WHERE `grupos_permissoes`.`grupo_id` = 7
GROUP BY `permissoes`.`nome`
) CI_count_all_results
SELECT `grupos_permissoes`.`id`, `grupos`.`id` AS `grupo_id`, `permissoes`.`id` AS `permissao_id`, `permissoes`.`nome`
FROM `grupos_permissoes`
JOIN `grupos` ON `grupos`.`id` = `grupos_permissoes`.`grupo_id`
JOIN `permissoes` ON `permissoes`.`id` = `grupos_permissoes`.`permissao_id`
WHERE `grupos_permissoes`.`grupo_id` = 7
GROUP BY `permissoes`.`nome`
 LIMIT 5
---
    public function recuperaPermissoesDoGrupo(int $grupo_id, int $quantidade_paginacao){

        $atributos = [

            'grupos_permissoes.id AS principal_id', //utulizado como identificador na hora de remover a permissão do grupo
            'grupos.id AS grupo_id',
            'permissoes.id AS permissao_id',
            'permissoes.nome'

        ];

        return $this->select($atributos)
                    ->join('grupos', 'grupos.id = grupos_permissoes.grupo_id')
                    ->join('permissoes', 'permissoes.id = grupos_permissoes.permissao_id')
                    ->where('grupos_permissoes.grupo_id', $grupo_id)
                    ->groupBy('permissoes.nome')
                    ->paginate($quantidade_paginacao);